R1=input('введите значение R1='); % ввод переменной R1
R2=input('введите значение R2='); % ввод переменной R2
R3=input('введите значение R3='); % ввод переменной R3
R4=input('введите значение R4='); % ввод переменной R4
R5=input('введите значение R5='); % ввод переменной R5
R6=input('введите значение R6='); % ввод переменной R6
R7=input('введите значение R7='); % ввод переменной R7
R8=input('введите значение R8='); % ввод переменной R8
R358=R3+R5+R8;%вычисление значения R358
R3578=R7*R358/(R358+R7);%вычисление значения R3578
R23578=R2+R3578;%вычисление значения R23578
R235678=R23578*R6/(R6+R23578);%вычисление значения R235678
Rekv=R1+R235678+R4;% расчет Rekv
disp('эквивалентное сопротивление');% вывод на экран Command Window Rekv
Rekv